Revit 2027 API
BuiltInFailures.ExportFailures.CannotAddPropertyToReservedPropertySet Property
 Cannot add properties to reserved property sets. Please see journal for details.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotAddPropertyToReservedPropertySet { get; }
Public Shared ReadOnly Property CannotAddPropertyToReservedPropertySet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotAddPropertyToReservedPropertySet {
	FailureDefinitionId^ get ();
}
static member CannotAddPropertyToReservedPropertySet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExportFailures Class
Autodesk.Revit.DB Namespace